ViacheslavMezentsev/stm32-cmake-yml/tests/firmware/semihosting/main.cpp
#include <stdio.h>
#include <stm32f1xx.h>
#include <core_cm3.h>
#include "version.h"
#include "build_metadata.h"

extern "C" {
volatile uint32_t smoke_data_probe = 0x12345678u;
volatile uint32_t smoke_bss_probe;
volatile uint32_t smoke_ctor_probe;
}
struct ConstructorProbe {
    ConstructorProbe() { smoke_ctor_probe = 0xC0DEC0DEu; }
};
static ConstructorProbe constructor_probe;

/**
 * @brief  Адрес регистра CPUID в блоке System Control Block (SCB).
 * @note   Этот адрес является стандартным для всех ядер Cortex-M.
 */
#define SCB_CPUID_ADDR ( 0xE000ED00UL )
#define SCB_CPUID      ( *( ( volatile const uint32_t* ) SCB_CPUID_ADDR ) )

/**
  * @brief  Код производителя ядра ARM Ltd.
  */
#define ARM_IMPLEMENTER_CODE (0x41UL)

/// Semihosting Initializing.
extern "C" void initialise_monitor_handles( void );

/// Обработчик прерывания SysTick.
extern "C" void SysTick_Handler( void )
{
    HAL_IncTick();
}

int counter = 0;

/**
 * @brief   Разбирает и выводит в консоль информацию из регистра CPUID.
 * @note    Не зависит от HAL. Может быть вызвана в любой момент.
 */
void print_cpu_id( void )
{
    uint32_t cpuid_val = SCB_CPUID;

    // --- Извлекаем поля из 32-битного значения ---

    // Поле Implementer: [31:24]
    uint8_t implementer = ( cpuid_val >> 24 ) & 0xFF;

    // Поле Variant: [23:20]
    uint8_t variant = ( cpuid_val >> 20 ) & 0x0F;

    // Поле Constant/Architecture: [19:16]
    // 0xF для архитектуры ARMv7-M
    uint8_t architecture = ( cpuid_val >> 16 ) & 0x0F;

    // Поле Part Number: [15:4]
    uint16_t part_no = ( cpuid_val >> 4 ) & 0xFFF;

    // Поле Revision: [3:0]
    uint8_t revision = cpuid_val & 0x0F;

    // --- Выводим информацию ---

    printf( "--- CPUID Register Analysis (Value: 0x%08lX) ---\n", cpuid_val );

    // 1. Implementer (Производитель ядра)
    printf( "  Implementer [31:24]: 0x%02X -> ", implementer );
    if ( implementer == 0x41 )
    {
        printf( "ARM Ltd. ('A')\n" );
    } else if ( implementer == 0x51 )
    {
        printf( "QEMU ('Q')\n" );
    } else
    {
        printf( "Unknown\n" );
    }

    // 2. Variant (Ревизия ядра)
    printf( "  Variant     [23:20]: 0x%X   -> r%dp\n", variant, variant );

    // 3. Architecture (Архитектура)
    printf( "  Architecture[19:16]: 0x%X   -> ", architecture );

    if ( architecture == 0xF )
    {
        printf( "ARMv7-M Architecture\n" );
    }
    else if ( architecture == 0xC )
    {
        printf( "ARMv6-M Architecture\n" );
    }
    else
    {
        printf( "Unknown Architecture\n" );
    }

    // 4. Part Number (Модель ядра)
    printf( "  Part Number [15:4]:  0x%03X -> ", part_no );

    switch ( part_no )
    {
        case 0xC20:
            printf( "Cortex-M0\n" );
            break;
        case 0xC60:
            printf( "Cortex-M0+\n" );
            break;
        case 0xC21:
            printf( "Cortex-M1\n" );
            break;
        case 0xC23:
            printf( "Cortex-M3\n" );
            break;
        case 0xC24:
            printf( "Cortex-M4\n" );
            break;
        case 0xC27:
            printf( "Cortex-M7\n" );
            break;
        case 0xD20:
            printf( "Cortex-M23\n" );
            break;
        case 0xD21:
            printf( "Cortex-M33\n" );
            break;
        default:
            printf( "Unknown Core\n" );
            break;
    }

    // 5. Revision (Патч ревизии)
    printf( "  Revision    [3:0]:   0x%X   -> p%d\n", revision, revision );

    printf( "-------------------------------------------------------\n" );
}

void print_firmware_info( void )
{
    // Блок вывода версий.
    printf( "--- Firmware build information ------------------------\n" );

    // 1. Версия компилятора GCC.
    printf( "  Compiler:    GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__ );

    // 2. Версия CMSIS Core.
    // Эти макросы определены в файле 'core_cm3.h' (или аналогичном для вашего ядра).
    printf( "  CMSIS Core:  v%d.%d\n", __CM3_CMSIS_VERSION_MAIN, __CM3_CMSIS_VERSION_SUB );

    // 3. Версия CMSIS Device (специфично для вендора, в нашем случае ST).
    // Эти макросы определены в файле 'stm32f1xx.h'.
    printf( "  CMSIS Device:  v%d.%d.%d\n",
            __STM32F1_CMSIS_VERSION_MAIN,
            __STM32F1_CMSIS_VERSION_SUB1,
            __STM32F1_CMSIS_VERSION_SUB2 );

    // 4. Версия библиотеки HAL.
    // Этот макрос определен в 'stm32f1xx_hal.h'.
    uint32_t hal_version = HAL_GetHalVersion();
    uint8_t hal_major = ( hal_version >> 24 ) & 0xFF;
    uint8_t hal_minor = ( hal_version >> 16 ) & 0xFF;
    uint8_t hal_patch = ( hal_version >> 8 ) & 0xFF;
    // uint8_t hal_rc = hal_version & 0xFF; // Ревизия (обычно 0)

    printf( "  STM32Cube HAL: v%d.%d.%d\n", hal_major, hal_minor, hal_patch );

    if ( 0 )
    {
        // 5. Уникальный ID устройства (если нужно).
        // Это не версия, но очень полезно для идентификации.
        uint32_t uid_word0 = HAL_GetUIDw0();
        uint32_t uid_word1 = HAL_GetUIDw1();
        uint32_t uid_word2 = HAL_GetUIDw2();

        printf( "  Device UID:    %08lX%08lX%08lX\n", uid_word2, uid_word1, uid_word0 );
    }

    // 6. Дата и время сборки (стандартные макросы препроцессора).
    printf( "  Build Date:    %s\n", __DATE__ );
    printf( "  Build Time:    %s\n", __TIME__ );

    printf( "  Version: %u.%u.%u.%u (%02u.%02u.%02u %02u:%02u:%02u)\n",
            Version.Major, Version.Minor, Version.Build, Version.Revision,
            DAY, MON, YEAR, HOUR, MIN, SEC );

    printf( "--------------------------------------------------\n" );
}

/**
 * \brief   Точка входа в программу.
 *
 */
// ARM SYS_EXIT_EXTENDED: reason + application status, both 32-bit words.
[[noreturn]] static void smoke_exit(uint32_t status)
{
    const uint32_t arguments[2] = {0x20026u, status};
    register uint32_t operation __asm__("r0") = 0x20u;
    register const uint32_t* parameter __asm__("r1") = arguments;
    __asm__ volatile("bkpt 0xAB" : "+r"(operation), "+r"(parameter) : : "memory");
    while (1) { __asm__ volatile("nop"); }
}

int main()
{
    const uint32_t initial_data = smoke_data_probe;
    const uint32_t initial_bss = smoke_bss_probe;
    const uint32_t initial_ctor = smoke_ctor_probe;
    // Инициализация библиотеки Semihosting.
    initialise_monitor_handles();

    // Инициализация библиотеки HAL.
    HAL_Init();

    print_firmware_info();

    print_cpu_id();

    printf("BUILD_TARGET=%s\n", SMOKE_MCU);
    printf("PROFILE=%s\nCMAKE=%s\nFRAMEWORK=%s\n", SMOKE_PROFILE, SMOKE_CMAKE, SMOKE_FRAMEWORK);
    printf("GIT_REVISION=%s\nGIT_DIRTY=%s\n", SMOKE_GIT, SMOKE_DIRTY);
    printf("CMSIS_CORE=%u.%u\n", __CM3_CMSIS_VERSION_MAIN, __CM3_CMSIS_VERSION_SUB);
    printf("CMSIS_DEVICE=%u.%u.%u\n", __STM32F1_CMSIS_VERSION_MAIN,
           __STM32F1_CMSIS_VERSION_SUB1, __STM32F1_CMSIS_VERSION_SUB2);
    const uint32_t hal_version = HAL_GetHalVersion();
    printf("HAL_VERSION=%lu.%lu.%lu\n", (hal_version >> 24) & 255u,
           (hal_version >> 16) & 255u, (hal_version >> 8) & 255u);
    printf("DATA_INIT=%08lX\nBSS_INIT=%08lX\nCTOR_INIT=%08lX\n", initial_data, initial_bss, initial_ctor);
    printf("DATA_ADDRESS=%08lX\nBSS_ADDRESS=%08lX\nCTOR_ADDRESS=%08lX\n",
           (uint32_t)&smoke_data_probe, (uint32_t)&smoke_bss_probe, (uint32_t)&smoke_ctor_probe);
    printf("EMULATOR_MACHINE=netduino2\n");
    fflush(stdout);
    if (initial_data != 0x12345678u || initial_bss != 0 || initial_ctor != 0xC0DEC0DEu) {
        printf("TEST_RESULT=FAIL\n");
        fflush(stdout);
        smoke_exit(2);
    }
#if defined(SMOKE_HANG)
    while (1) { __asm__ volatile("nop"); }
#elif defined(SMOKE_FAIL)
    printf("TEST_RESULT=FAIL\n");
    fflush(stdout);
    smoke_exit(1);
#else
    printf("TEST_RESULT=PASS\n");
    fflush(stdout);
    smoke_exit(0);
#endif
}
